# 📚 Полезные ссылки на статьи и разборы задач:
# 📘 Полная версия шпаргалки доступна в нашем тг канале: https://t.me/informatika_kege_itpy/362?comment=6532
# 📘 Разборы 27 номеров по информатике: https://t.me/informatika_kege_itpy/360?comment=7007

# region Место для вашего конспекта ⬇️
'''
Запустите бота: https://t.me/ilandroxxy_bot и нажмите кнопку: "📚 Получить конспект"
'''
# endregion Место для вашего конспекта ⬆️

# Домашка 27 номер: https://stepik.org/lesson/1400061/step/1?unit=1417014

# Практика 27 номер: https://stepik.org/lesson/1400062/step/1?unit=1417015
